#

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

np.random.seed(0)

In [7]:
df = pd.read_csv('ds_salaries.csv')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    607 non-null    object
 2   employment_type     607 non-null    object
 3   job_title           607 non-null    object
 4   salary              607 non-null    int64
 5   salary_currency     594 non-null    object
 6   salary_in_usd       607 non-null    int64
 7   employee_residence  607 non-null    object
 8   remote_ratio        607 non-null    int64
 9   company_location    595 non-null    object
 10  company_size        584 non-null    object
dtypes: int64(4), object(7)
memory usage: 52.3+ KB

In [9]:
df.shape

(607, 11)

In [10]:
100 * df[df['company_location'] == 'US'].shape[0]/607

57.49588138385502

In [11]:
df['company_size'].unique()

array(['L', 'S', 'M', nan], dtype=object)

In [12]:
df[df['company_size'] == 'L'].shape

(197, 11)

In [13]:
100 - 100 * df.count().sum()/(df.shape[0]*df.shape[1])

0.7188857271229665

In [14]:
df[(df['company_location'].notnull())&(df['salary_currency'].isna())].shape

(13, 11)

In [15]:
df[df['salary_currency'].isna()]['company_location'].unique()

array(['US', 'LU', 'FR', 'IN'], dtype=object)

In [16]:
df['salary_currency'] = np.where((df['salary_currency'].isna()) & 
                                 (df['company_location'] == 'US'),
                                 'USD', df['salary_currency'])

df['salary_currency'] = np.where((df['salary_currency'].isna()) & 
                                 (df['company_location'] == 'IN'),
                                 'INR', df['salary_currency'])

df['salary_currency'] = np.where((df['salary_currency'].isna()) & 
                                 (df['company_location'] == 'FR'),
                                 'EUR', df['salary_currency'])

df['salary_currency'] = np.where((df['salary_currency'].isna()) & 
                                 (df['company_location'] == 'LU'),
                                 'EUR', df['salary_currency'])

df['salary_currency'].value_counts()

USD    398
EUR     95
GBP     44
INR     27
CAD     18
PLN      3
JPY      3
TRY      3
CNY      2
HUF      2
BRL      2
MXN      2
AUD      2
SGD      2
DKK      2
CLP      1
CHF      1
Name: salary_currency, dtype: int64

In [17]:
df['company_size'].value_counts()

M    304
L    197
S     83
Name: company_size, dtype: int64

In [18]:
df['company_size'].replace(np.nan, 'M', inplace = True)
df['company_size'].value_counts()

M    327
L    197
S     83
Name: company_size, dtype: int64

In [19]:
df[(df['company_location'] != df['employee_residence']) &
  (df['company_location'].isna())]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
13,2021,SE,FT,Data Scientist,110000,CAD,87738,CA,100,NaN,S
81,2021,MI,FT,Machine Learning Engineer,75000,EUR,88654,BE,100,NaN,M
93,2021,MI,PT,Data Engineer,59000,EUR,69741,NL,100,NaN,L
184,2021,MI,FT,Data Scientist,2500000,INR,33808,IN,0,NaN,M
336,2021,EN,FT,Data Scientist,90000,USD,90000,US,100,NaN,S
350,2021,EN,FT,Research Scientist,100000,USD,100000,JE,0,NaN,L
351,2021,SE,CT,Staff Data Scientist,105000,USD,105000,US,100,NaN,M
352,2021,MI,FT,Research Scientist,69999,USD,69999,CZ,50,NaN,L
374,2022,SE,FT,Data Scientist,120160,USD,120160,US,100,NaN,M
388,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,NaN,M
389,2022,SE,FT,Data Analyst,112900,USD,112900,US,100,NaN,M
390,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,NaN,M

In [20]:
df['company_location'] = np.where(df['company_location'].isna(), 
                                  df['employee_residence'], 
                                  df['company_location'])

df[df['company_location'] == 'IN'].shape

(24, 11)

In [21]:
df.drop(['salary', 'salary_currency'], axis = 1, inplace = True)
df.shape

(607, 9)

In [22]:
len(df['employee_residence'].unique())

57

In [23]:
df['same_location'] = np.where(df['employee_residence'] == df['company_location'], 1, 0)
df.head()
df['same_location'].sum()

557

In [24]:
df.drop('employee_residence', axis = 1, inplace = True)

In [25]:
len(df['company_location'].unique())

51

In [26]:
df['company_location'] = np.where(df['company_location'] == 'US', 'US', 'other')
df['company_location'].value_counts()

US       355
other    252
Name: company_location, dtype: int64

In [27]:
df['company_location'] = df['company_location'].map({'US': 1, 'other':0}).astype(int)
df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size,same_location
0,2020,EX,FT,Director of Data Science,325000,100,1,L,1
1,2020,EN,FT,Machine Learning Engineer,138000,100,1,S,1
2,2020,MI,FT,Data Scientist,62726,50,0,S,0
3,2022,MI,FT,Machine Learning Engineer,87425,100,0,L,1
4,2022,EN,FT,Data Scientist,86703,50,0,M,1

In [28]:
df['employment_type'].unique()

array(['FT', 'PT', 'CT', 'FL'], dtype=object)

In [29]:
cols = pd.get_dummies(df['employment_type'], prefix = 'employment_type')
df[cols.columns] = cols
df.drop('employment_type', axis = 1, inplace = True)

In [30]:
df['company_size'].value_counts()

M    327
L    197
S     83
Name: company_size, dtype: int64

In [31]:
df['company_size'] = df['company_size'].map({'S':0, 'M':1, 'L': 2}).astype(int)

In [32]:
len(df['job_title'].unique())

50

In [33]:
df.drop('job_title', axis = 1, inplace = True)

In [34]:
df['experience_level'].value_counts()

SE    280
MI    213
EN     88
EX     26
Name: experience_level, dtype: int64

In [35]:
df['experience_level'] = df['experience_level'].map({'EN': 0, 'MI': 1, 'EX': 2, 'SE': 3}).astype(int)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    607 non-null    int32
 2   salary_in_usd       607 non-null    int64
 3   remote_ratio        607 non-null    int64
 4   company_location    607 non-null    int32
 5   company_size        607 non-null    int32
 6   same_location       607 non-null    int32
 7   employment_type_CT  607 non-null    uint8
 8   employment_type_FL  607 non-null    uint8
 9   employment_type_FT  607 non-null    uint8
 10  employment_type_PT  607 non-null    uint8
dtypes: int32(4), int64(3), uint8(4)
memory usage: 26.2 KB

In [37]:
df.shape

(607, 11)

In [38]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import statsmodels.api as sm

In [39]:
from sklearn.model_selection import train_test_split

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    607 non-null    int32
 2   salary_in_usd       607 non-null    int64
 3   remote_ratio        607 non-null    int64
 4   company_location    607 non-null    int32
 5   company_size        607 non-null    int32
 6   same_location       607 non-null    int32
 7   employment_type_CT  607 non-null    uint8
 8   employment_type_FL  607 non-null    uint8
 9   employment_type_FT  607 non-null    uint8
 10  employment_type_PT  607 non-null    uint8
dtypes: int32(4), int64(3), uint8(4)
memory usage: 26.2 KB

In [41]:
df.columns

Index(['work_year', 'experience_level', 'salary_in_usd', 'remote_ratio',
       'company_location', 'company_size', 'same_location',
       'employment_type_CT', 'employment_type_FL', 'employment_type_FT',
       'employment_type_PT'],
      dtype='object')

In [42]:
X=df.drop(["salary_in_usd"],axis=1)
y=df["salary_in_usd"]

In [43]:
X.mean()

work_year             2021.405272
experience_level         1.820428
remote_ratio            70.922570
company_location         0.584843
company_size             1.187809
same_location            0.917628
employment_type_CT       0.008237
employment_type_FL       0.006590
employment_type_FT       0.968699
employment_type_PT       0.016474
dtype: float64

In [44]:
from sklearn.preprocessing import MinMaxScaler

In [45]:
X=df.drop(["salary_in_usd"],axis=1)
y=df["salary_in_usd"]

In [46]:
scaler=MinMaxScaler()
scaler.fit(X)
X_scaled=scaler.transform(X)

In [47]:
X_scaled=pd.DataFrame(X_scaled, columns = X.columns)

In [48]:
X_scaled

,work_year,experience_level,remote_ratio,company_location,company_size,same_location,employment_type_CT,employment_type_FL,employment_type_FT,employment_type_PT
0,0.0,0.666667,1.0,1.0,1.0,1.0,0.0,0.0,1.0,0.0
1,0.0,0.000000,1.0,1.0,0.0,1.0,0.0,0.0,1.0,0.0
2,0.0,0.333333,0.5,0.0,0.0,0.0,0.0,0.0,1.0,0.0
3,1.0,0.333333,1.0,0.0,1.0,1.0,0.0,0.0,1.0,0.0
4,1.0,0.000000,0.5,0.0,0.5,1.0,0.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...
602,0.5,0.333333,0.0,0.0,1.0,1.0,0.0,0.0,1.0,0.0
603,0.5,0.666667,1.0,1.0,1.0,1.0,0.0,0.0,1.0,0.0
604,0.5,0.000000,1.0,0.0,0.5,1.0,0.0,0.0,1.0,0.0
605,1.0,1.000000,0.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0
606,1.0,1.000000,1.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0

In [49]:
x=X_scaled
y=df["salary_in_usd"]

In [50]:
df.shape

(607, 11)

In [51]:
# using the train test split function
X_train, X_test, y_train, y_test = train_test_split(X_scaled,y , random_state=0,test_size=0.25, shuffle=True)

In [52]:
print('X_train: ')
print(X_train.head())
print(X_train.shape)
print('y_train: ')
print(y_train.head())
print(y_train.shape)

X_train:
     work_year  experience_level  remote_ratio  company_location  \
213        0.0          0.333333           1.0               1.0
471        1.0          1.000000           1.0               1.0
46         0.0          0.333333           1.0               0.0
266        0.5          0.000000           1.0               1.0
466        1.0          1.000000           0.0               1.0

     company_size  same_location  employment_type_CT  employment_type_FL  \
213           1.0            1.0                 0.0                 0.0
471           0.5            1.0                 0.0                 0.0
46            0.5            1.0                 0.0                 0.0
266           0.5            1.0                 0.0                 0.0
466           0.5            1.0                 0.0                 0.0

     employment_type_FT  employment_type_PT
213                 1.0                 0.0
471                 1.0                 0.0
46                  1.0                 0.0
266                 1.0                 0.0
466                 1.0                 0.0
(455, 10)
y_train:
213    135000
471    180000
46      38776
266     50000
466    189650
Name: salary_in_usd, dtype: int64
(455,)

# Q1

In [101]:
print(X_train.mean())

work_year             0.707692
experience_level      0.595604
remote_ratio          0.697802
company_location      0.575824
company_size          0.593407
same_location         0.920879
employment_type_CT    0.004396
employment_type_FL    0.004396
employment_type_FT    0.971429
employment_type_PT    0.019780
dtype: float64

In [54]:
X_train

,work_year,experience_level,remote_ratio,company_location,company_size,same_location,employment_type_CT,employment_type_FL,employment_type_FT,employment_type_PT
213,0.0,0.333333,1.0,1.0,1.0,1.0,0.0,0.0,1.0,0.0
471,1.0,1.000000,1.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0
46,0.0,0.333333,1.0,0.0,0.5,1.0,0.0,0.0,1.0,0.0
266,0.5,0.000000,1.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0
466,1.0,1.000000,0.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...
277,0.5,0.333333,1.0,1.0,1.0,1.0,0.0,0.0,1.0,0.0
9,0.5,0.333333,1.0,0.0,1.0,1.0,0.0,0.0,1.0,0.0
359,1.0,0.333333,1.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0
192,1.0,0.333333,1.0,0.0,0.5,1.0,0.0,0.0,1.0,0.0
559,1.0,1.000000,1.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0

In [55]:
y_train

213    135000
471    180000
46      38776
266     50000
466    189650
        ...
277    135000
9      187442
359    170000
192     18442
559     80000
Name: salary_in_usd, Length: 455, dtype: int64

In [56]:
X_train.describe()

,work_year,experience_level,remote_ratio,company_location,company_size,same_location,employment_type_CT,employment_type_FL,employment_type_FT,employment_type_PT
count,455.000000,455.000000,455.000000,455.000000,455.000000,455.000000,455.000000,455.000000,455.000000,455.000000
mean,0.707692,0.595604,0.697802,0.575824,0.593407,0.920879,0.004396,0.004396,0.971429,0.019780
std,0.346865,0.387747,0.408332,0.494761,0.329464,0.270224,0.066226,0.066226,0.166782,0.139398
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.500000,0.333333,0.500000,0.000000,0.500000,1.000000,0.000000,0.000000,1.000000,0.000000
50%,1.000000,0.333333,1.000000,1.000000,0.500000,1.000000,0.000000,0.000000,1.000000,0.000000
75%,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.000000,0.000000,1.000000,0.000000
max,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [57]:
y_train.describe()

count       455.000000
mean     112279.538462
std       71308.233369
min        2859.000000
25%       62688.500000
50%      103160.000000
75%      150000.000000
max      600000.000000
Name: salary_in_usd, dtype: float64

# Q2

In [58]:
import scipy.stats as st

In [59]:
val = st.pearsonr(X_train['experience_level'], y_train)
val

(0.4523202462402573, 2.5003246781045545e-24)

In [60]:
print('Correlation coefficient: ', val[0])
print('p-value (two-tailed): %.5f'%val[1])

Correlation coefficient:  0.4523202462402573
p-value (two-tailed): 0.00000

# Q4

In [61]:
import statsmodels.api as sm
from sklearn.linear_model import LinearRegression
import numpy as np

In [62]:
lreg=LinearRegression()

In [63]:
X_new=np.array(X_train['experience_level'])

In [64]:
lreg.fit(X_new.reshape(-1,1),y_train)

LinearRegression()

In [65]:
lreg.coef_

array([83183.51114069])

# Q5

In [66]:
from sklearn.linear_model import LinearRegression

In [67]:
lreg = LinearRegression()

In [68]:
#training the model using the fit function
lreg.fit(X_train,y_train)

LinearRegression()

In [69]:
#predicting and evaluating
print('score:', lreg.score(X_train,y_train))

score: 0.3908554920836873

In [70]:
# model coefficients
lreg.coef_

array([ -4896.03738803,  52185.40944233,   3033.96912126,  58901.18434136,
        22197.73901242,  26407.66618423, 122379.37867303, -50349.06379976,
       -25588.07270224, -46442.24217102])

In [71]:
#finding the intercept
lreg.intercept_

36597.18375005809

# Q6

In [72]:
import scipy.stats as st

In [73]:
X_train.info()
y_test

<class 'pandas.core.frame.DataFrame'>
Int64Index: 455 entries, 213 to 559
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           455 non-null    float64
 1   experience_level    455 non-null    float64
 2   remote_ratio        455 non-null    float64
 3   company_location    455 non-null    float64
 4   company_size        455 non-null    float64
 5   same_location       455 non-null    float64
 6   employment_type_CT  455 non-null    float64
 7   employment_type_FL  455 non-null    float64
 8   employment_type_FT  455 non-null    float64
 9   employment_type_PT  455 non-null    float64
dtypes: float64(10)
memory usage: 39.1 KB

575    105000
52      42197
530    112900
345     85000
55      47282
        ...
252     12000
526    214000
372    200000
89      65013
268    120000
Name: salary_in_usd, Length: 152, dtype: int64

In [74]:
val1 = st.pearsonr(X_train['work_year'], y_train)
val1
print('Correlation coefficient: ', val1[0])
print('p-value (two-tailed)_WORK_YEAR: %.5f'%val1[1])

Correlation coefficient:  0.179088120126354
p-value (two-tailed)_WORK_YEAR: 0.00012

In [75]:
val2 = st.pearsonr(X_train['remote_ratio'], y_train)
val2
print('Correlation coefficient: ', val2[0])
print('p-value (two-tailed)_REMOTE_RATIO: %.5f'%val2[1])

Correlation coefficient:  0.12740848705765798
p-value (two-tailed)_REMOTE_RATIO: 0.00650

In [76]:
val3 = st.pearsonr(X_train['company_location'], y_train)
val3
print('Correlation coefficient: ', val3[0])
print('p-value (two-tailed)_COMPANY_LOCATION: %.5f'%val3[1])

Correlation coefficient:  0.5270912123076588
p-value (two-tailed)_COMPANY_LOCATION: 0.00000

In [77]:
val4 = st.pearsonr(X_train['company_size'], y_train)
val4
print('Correlation coefficient: ', val4[0])
print('p-value (two-tailed)_COMPANY_SIZE: %.5f'%val4[1])

Correlation coefficient:  0.12719747783058694
p-value (two-tailed)_COMPANY_SIZE: 0.00659

In [78]:
val5 = st.pearsonr(X_train['same_location'], y_train)
val5
print('Correlation coefficient: ', val5[0])
print('p-value (two-tailed)_SAME_LOCATION: %.5f'%val5[1])

Correlation coefficient:  0.14318558818274002
p-value (two-tailed)_SAME_LOCATION: 0.00220

In [79]:
val6 = st.pearsonr(X_train['employment_type_CT'], y_train)
val6
print('Correlation coefficient: ', val6[0])
print('p-value (two-tailed)_EMPLOYMENT_TYPE_CT: %.5f'%val6[1])

Correlation coefficient:  0.10415825288604103
p-value (two-tailed)_EMPLOYMENT_TYPE_CT: 0.02630

In [80]:
val7 = st.pearsonr(X_train['employment_type_FL'], y_train)
val7
print('Correlation coefficient: ', val7[0])
print('p-value (two-tailed)_EMPLOYMENT_TYPE_FL: %.5f'%val7[1])

Correlation coefficient:  -0.05249942161417113
p-value (two-tailed)_EMPLOYMENT_TYPE_FL: 0.26376

In [81]:
val8 = st.pearsonr(X_train['employment_type_FT'], y_train)
val8
print('Correlation coefficient: ', val8[0])
print('p-value (two-tailed)_EMPLOYMENT_TYPE_FT: %.5f'%val8[1])

Correlation coefficient:  0.10761474456705981
p-value (two-tailed)_EMPLOYMENT_TYPE_FT: 0.02168

In [82]:
val9 = st.pearsonr(X_train['employment_type_PT'], y_train)
val9
print('Correlation coefficient: ', val9[0])
print('p-value (two-tailed)_EMPLOYMENT_TYPE_PT: %.5f'%val9[1])

Correlation coefficient:  -0.15329810179836428
p-value (two-tailed)_EMPLOYMENT_TYPE_PT: 0.00104

# Q7

In [83]:
X_train

,work_year,experience_level,remote_ratio,company_location,company_size,same_location,employment_type_CT,employment_type_FL,employment_type_FT,employment_type_PT
213,0.0,0.333333,1.0,1.0,1.0,1.0,0.0,0.0,1.0,0.0
471,1.0,1.000000,1.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0
46,0.0,0.333333,1.0,0.0,0.5,1.0,0.0,0.0,1.0,0.0
266,0.5,0.000000,1.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0
466,1.0,1.000000,0.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...
277,0.5,0.333333,1.0,1.0,1.0,1.0,0.0,0.0,1.0,0.0
9,0.5,0.333333,1.0,0.0,1.0,1.0,0.0,0.0,1.0,0.0
359,1.0,0.333333,1.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0
192,1.0,0.333333,1.0,0.0,0.5,1.0,0.0,0.0,1.0,0.0
559,1.0,1.000000,1.0,1.0,0.5,1.0,0.0,0.0,1.0,0.0

In [84]:
X_train_MLR=X_train.drop(['employment_type_FL'],axis=1)
X_train_MLR

,work_year,experience_level,remote_ratio,company_location,company_size,same_location,employment_type_CT,employment_type_FT,employment_type_PT
213,0.0,0.333333,1.0,1.0,1.0,1.0,0.0,1.0,0.0
471,1.0,1.000000,1.0,1.0,0.5,1.0,0.0,1.0,0.0
46,0.0,0.333333,1.0,0.0,0.5,1.0,0.0,1.0,0.0
266,0.5,0.000000,1.0,1.0,0.5,1.0,0.0,1.0,0.0
466,1.0,1.000000,0.0,1.0,0.5,1.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...
277,0.5,0.333333,1.0,1.0,1.0,1.0,0.0,1.0,0.0
9,0.5,0.333333,1.0,0.0,1.0,1.0,0.0,1.0,0.0
359,1.0,0.333333,1.0,1.0,0.5,1.0,0.0,1.0,0.0
192,1.0,0.333333,1.0,0.0,0.5,1.0,0.0,1.0,0.0
559,1.0,1.000000,1.0,1.0,0.5,1.0,0.0,1.0,0.0

In [85]:
X_train_MLR=X_train.drop(['employment_type_FL'],axis=1)
import statsmodels.api as sm

X = sm.add_constant(X_train_MLR)

C:\Users\Soundarya\Anaconda\lib\site-packages\statsmodels\tsa\tsatools.py:142: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only
  x = pd.concat(x[::order], 1)

# Q8 &7

In [86]:
model=sm.OLS(y_train,X).fit()
model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:          salary_in_usd   R-squared:                       0.391
Model:                            OLS   Adj. R-squared:                  0.379
Method:                 Least Squares   F-statistic:                     31.73
Date:                Sun, 06 Nov 2022   Prob (F-statistic):           7.05e-43
Time:                        16:45:05   Log-Likelihood:                -5616.9
No. Observations:                 455   AIC:                         1.125e+04
Df Residuals:                     445   BIC:                         1.129e+04
Df Model:                           9
Covariance Type:            nonrobust
======================================================================================
                         coef    std err          t      P>|t|      [0.025      0.975]
--------------------------------------------------------------------------------------
const              -1.375e+04   4.09e+04     -0.336      0.737   -9.41e+04    6.66e+04
work_year          -4896.0374   8212.200     -0.596      0.551    -2.1e+04    1.12e+04
experience_level    5.219e+04   7748.059      6.735      0.000     3.7e+04    6.74e+04
remote_ratio        3033.9691   6693.022      0.453      0.651   -1.01e+04    1.62e+04
company_location     5.89e+04   5961.831      9.880      0.000    4.72e+04    7.06e+04
company_size         2.22e+04   8115.162      2.735      0.006    6248.936    3.81e+04
same_location       2.641e+04   1.01e+04      2.623      0.009    6618.723    4.62e+04
employment_type_CT  1.727e+05   5.63e+04      3.069      0.002    6.21e+04    2.83e+05
employment_type_FT  2.476e+04   4.01e+04      0.617      0.537   -5.41e+04    1.04e+05
employment_type_PT  3906.8216   4.42e+04      0.088      0.930    -8.3e+04    9.08e+04
==============================================================================
Omnibus:                      290.324   Durbin-Watson:                   1.799
Prob(Omnibus):                  0.000   Jarque-Bera (JB):             3857.580
Skew:                           2.540   Prob(JB):                         0.00
Kurtosis:                      16.329   Cond. No.                         70.2
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

# Q9

In [87]:
X_train_MLR2=X_train_MLR.drop(['remote_ratio','work_year','employment_type_FT','employment_type_PT'],axis=1)
X_train_MLR2

,experience_level,company_location,company_size,same_location,employment_type_CT
213,0.333333,1.0,1.0,1.0,0.0
471,1.000000,1.0,0.5,1.0,0.0
46,0.333333,0.0,0.5,1.0,0.0
266,0.000000,1.0,0.5,1.0,0.0
466,1.000000,1.0,0.5,1.0,0.0
...,...,...,...,...,...
277,0.333333,1.0,1.0,1.0,0.0
9,0.333333,0.0,1.0,1.0,0.0
359,0.333333,1.0,0.5,1.0,0.0
192,0.333333,0.0,0.5,1.0,0.0
559,1.000000,1.0,0.5,1.0,0.0

In [88]:
import statsmodels.api as sm
X = sm.add_constant(X_train_MLR2)

C:\Users\Soundarya\Anaconda\lib\site-packages\statsmodels\tsa\tsatools.py:142: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only
  x = pd.concat(x[::order], 1)

In [89]:
model=sm.OLS(y_train,X).fit()
model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:          salary_in_usd   R-squared:                       0.388
Model:                            OLS   Adj. R-squared:                  0.381
Method:                 Least Squares   F-statistic:                     56.95
Date:                Sun, 06 Nov 2022   Prob (F-statistic):           8.07e-46
Time:                        16:45:05   Log-Likelihood:                -5617.9
No. Observations:                 455   AIC:                         1.125e+04
Df Residuals:                     449   BIC:                         1.127e+04
Df Model:                           5
Covariance Type:            nonrobust
======================================================================================
                         coef    std err          t      P>|t|      [0.025      0.975]
--------------------------------------------------------------------------------------
const               8596.1556   1.08e+04      0.798      0.425   -1.26e+04    2.98e+04
experience_level    5.234e+04   7401.487      7.072      0.000    3.78e+04    6.69e+04
company_location    5.938e+04   5767.967     10.295      0.000     4.8e+04    7.07e+04
company_size        2.324e+04   8044.783      2.889      0.004    7431.091    3.91e+04
same_location       2.592e+04   9883.681      2.622      0.009    6491.615    4.53e+04
employment_type_CT  1.494e+05   4.01e+04      3.730      0.000    7.07e+04    2.28e+05
==============================================================================
Omnibus:                      291.501   Durbin-Watson:                   1.793
Prob(Omnibus):                  0.000   Jarque-Bera (JB):             3916.688
Skew:                           2.550   Prob(JB):                         0.00
Kurtosis:                      16.438   Cond. No.                         26.4
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

# Q10

In [90]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler

from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error

In [91]:
X_train, X_valid, y_train, y_valid = train_test_split(X_scaled,y,test_size = 0.25, random_state = 0)

In [92]:
scaler = MinMaxScaler()
scaler.fit(X_train)
X_train_scaled = scaler.transform(X_train)
X_valid_scaled = scaler.transform(X_valid)

In [93]:
lreg = LinearRegression()
lreg.fit(X_train_scaled, y_train)

LinearRegression()

In [94]:
print('train r2-score: ', lreg.score(X_train_scaled, y_train))

train r2-score:  0.3908554920836873

# Q11

In [95]:
print('validation r2-score: ', lreg.score(X_valid_scaled, y_valid))

validation r2-score:  0.31691126421645843

# Q12

In [96]:
print("The gap between trainin and validation score is: train r2-score:  0.3908554920836873 -  validation r2-score:  0.31691126421645843")
print("0.07394422786722887")
print(0.07394422786722887*100)
print("10% of training score is :",0.39*10/100)

The gap between trainin and validation score is: train r2-score:  0.3908554920836873 -  validation r2-score:  0.31691126421645843
0.07394422786722887
7.394422786722887
10% of training score is : 0.03900000000000001